//组件配置
export default {
	edit: {
		//类型控件
		typeCtrl: [6, 7, 10, 12, 18,25, 26, 28, 29],
		//天气控件
		weatherCtrl: [11,22],
		//关系控件
		relationCtrl: [3, 4, 6, 7, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 22,24, 25, 26,27, 28, 29, 30],
		//阶段控件
		stageCtrl: [4, 14, 15, 16,27, 31, 32],
		placeCtrl: [17]
	},
	list: {
		//头部tab控件
		tabCtrl: [6, 7, 10, 12, 18,25, 26, 28, 29],
		//自述控件
		selfDescCtrl: [8, 9],
		//关系控件
		relationCtrl: [3, 4, 6, 7, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 22, 24,25,26,27, 28, 29, 30],
		//阶段控件
		stageCtrl: [4, 14, 15, 16,27, 31, 32],
		placeCtrl: [17]
	},
	detail: {
		//类型控件
		typeCtrl: [6, 7, 10, 12, 18, 25, 26, 28, 29],
		//天气控件
		weatherCtrl: [11,22],
		//关系控件
		relationCtrl: [3, 4, 6, 7, 9, 10, 11, 13, 12, 14, 15, 16, 17, 18, 22,24, 25,26,27, 28, 29, 30],
		//阶段控件
		stageCtrl: [4, 14, 15, 16,27, 31, 32],
		placeCtrl: [17]
	}
}
